In [1]:
# Versão da Linguagem Python
from platform import python_version
print('Versão de Python Neste Jupyter Notebook:', python_version())

# usaremos o filtro 'warning' para deixar mais limpo.
import warnings
warnings.filterwarnings('ignore')

Versão de Python Neste Jupyter Notebook: 3.10.5

### Obtendo dados para Python

A primeira etapa da análise de dados é obter os dados. Mover seus dados de onde você os armazenou para suas ferramentas analíticas e voltar novamente pode ser uma tarefa difícil se você não souber o que está fazendo. O Python e suas bibliotecas tentam torná-lo o mais fácil possível.

Com apenas algumas linhas de código, você poderá importar e exportar dados nos seguintes formatos:

- CSV
- Excel
- SQL

#### Carregando dados de arquivos CSV

Normalmente, os dados chegarão até nós como arquivos ou links de banco de dados.

In [2]:
# Carregando dados do arquivo CSV.

import pandas as pd

arquivo = "datasets/smallgradesh.csv"
df = pd.read_csv(arquivo, header = None)

Agora, vamos dar uma olhada em como nossos dados se parecem

In [3]:
# Exibir as cinco primeiras linhas de dados.

df.head()

         0      1
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

Como você pode ver, nosso dataframe não possui cabeçalhos de coluna. Ou melhor, existem cabeçalhos, mas não foram carregados como cabeçalhos; eles foram carregados como linha um de seus dados.

In [4]:
# Carregando dados do arquivo CSV com cabeçalhos.

caminho = "datasets/gradedata.csv" 
df = pd.read_csv(caminho)

In [5]:
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

Se você tiver um conjunto de dados que não inclua cabeçalhos, poderá adicioná-los posteriormente.

In [6]:
# Carregando dados do arquivo CSV e adicionando cabeçalhos.arquivo

caminho = "datasets/smallgrades.csv"

# Para adicionar cabeçalhos enquanto carregamos os dados.
df = pd.read_csv(caminho, 
                 names = ['Names', 'Grades'])

# Para adicionar cabeçalhos a um dataframe.
df.columns = ['Names', 'Grades']

In [7]:
df.head()

     Names  Grades
0   Marcia    82.4
1   Kadeem    78.2
2     Nash    79.3
3  Noelani    83.2
4  Noelani    87.4

#### Salvando dados em CSV

Talvez você queira salvar seu progresso ao analisar dados. Talvez você esteja apenas usando o Python para massagear alguns dados para análise posterior em outra ferramenta. Ou talvez você tenha algum outro motivo para exportar seu dataframe para um arquivo CSV.

In [8]:
# Exportando um conjunto de dados para CSV

nomes = ['Bob', 'Jessica', 'Mary', 'John', 'Mel'] 
notas = [76, 95, 77, 78, 99]
GradeList = zip(nomes, notas) 

df = pd.DataFrame(data = GradeList, 
                  columns = ['Nomes', 'Notas'])

df.to_csv('datasets/studentgrades.csv',
          index = False,
          header = False)

- As linhas 3 a 8 são as linhas que criam o dataframe. 
- A linha 10 é o código para exporte o dataframe df para um arquivo CSV chamado studentgrades.csv.

Os únicos parâmetros que usamos são index e header. Configurando estes parâmetros como falso impedirá que os nomes de índice e cabeçalho sejam exportados. Altere os valores desses parâmetros para entender melhor seu uso.

Se você deseja informações detalhadas sobre o método to_csv,

In [9]:
# Obtendo ajuda para to_csv

df.to_csv?

Signature:
df.to_csv(
    path_or_buf: 'FilePath | WriteBuffer[bytes] | WriteBuffer[str] | None' = None,
    sep: 'str' = ',',
    na_rep: 'str' = '',
    float_format: 'str | None' = None,
    columns: 'Sequence[Hashable] | None' = None,
    header: 'bool_t | list[str]' = True,
    index: 'bool_t' = True,
    index_label: 'IndexLabel | None' = None,
    mode: 'str' = 'w',
    encoding: 'str | None' = None,
    compression: 'CompressionOptions' = 'infer',
    quoting: 'int | None' = None,
    quotechar: 'str' = '"',
    line_terminator: 'str | None' = None,
    chunksize: 'int | None' = None,
    date_format: 'str | None' = None,
    doublequote: 'bool_t' = True,
    escapechar: 'str | None' = None,
    decimal: 'str' = '.',
    errors: 'str' = 'strict',
    storage_options: 'StorageOptions' = None,
) -> 'str | None'
Docstring:
Write object to a comma-separated values (csv) file.

Parameters
----------
path_or_buf : str, path object, file-like object, or None, default None
    String, path object (implementing os.PathLike[str]), or file-like
    object implementing a write() function. If None, the result is
    returned as a string. If a non-binary file object is passed, it should
    be opened with `newline=''`, disabling universal newlines. If a binary
    file object is passed, `mode` might need to contain a `'b'`.

    .. versionchanged:: 1.2.0

       Support for binary file objects was introduced.

sep : str, default ','
    String of length 1. Field delimiter for the output file.
na_rep : str, default ''
    Missing data representation.
float_format : str, default None
    Format string for floating point numbers.
columns : sequence, optional
    Columns to write.
header : bool or list of str, default True
    Write out the column names. If a list of strings is given it is
    assumed to be aliases for the column names.
index : bool, default True
    Write row names (index).
index_label : str or sequence, or False, default None
    Column label for index column(s) if desired. If None is given, and
    `header` and `index` are True, then the index names are used. A
    sequence should be given if the object uses MultiIndex. If
    False do not print fields for index names. Use index_label=False
    for easier importing in R.
mode : str
    Python write mode, default 'w'.
encoding : str, optional
    A string representing the encoding to use in the output file,
    defaults to 'utf-8'. `encoding` is not supported if `path_or_buf`
    is a non-binary file object.
compression : str or dict, default 'infer'
    For on-the-fly compression of the output data. If 'infer' and '%s'
    path-like, then detect compression from the following extensions: '.gz',
    '.bz2', '.zip', '.xz', or '.zst' (otherwise no compression). Set to
    ``None`` for no compression. Can also be a dict with key ``'method'`` set
    to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``} and other
    key-value pairs are forwarded to ``zipfile.ZipFile``, ``gzip.GzipFile``,
    ``bz2.BZ2File``, or ``zstandard.ZstdDecompressor``, respectively. As an
    example, the following could be passed for faster compression and to create
    a reproducible gzip archive:
    ``compression={'method': 'gzip', 'compresslevel': 1, 'mtime': 1}``.

    .. versionchanged:: 1.0.0

       May now be a dict with key 'method' as compression mode
       and other entries as additional compression options if
       compression mode is 'zip'.

    .. versionchanged:: 1.1.0

       Passing compression options as keys in dict is
       supported for compression modes 'gzip', 'bz2', 'zstd', and 'zip'.

    .. versionchanged:: 1.2.0

        Compression is supported for binary file objects.

    .. versionchanged:: 1.2.0

        Previous versions forwarded dict entries for 'gzip' to
        `gzip.open` instead of `gzip.GzipFile` which prevented
        setting `mtime`.

quoting : optional constant from csv module
    Defaults to csv.QUOTE_MINIMAL. If you have set a `float_format`
    then floats are converted to strings and thus csv.QUOTE_NONNUMERIC
    will treat them as non-numeric.
quotechar : str, default '\"'
    String of length 1. Character used to quote fields.
line_terminator : str, optional
    The newline character or character sequence to use in the output
    file. Defaults to `os.linesep`, which depends on the OS in which
    this method is called ('\\n' for linux, '\\r\\n' for Windows, i.e.).
chunksize : int or None
    Rows to write at a time.
date_format : str, default None
    Format string for datetime objects.
doublequote : bool, default True
    Control quoting of `quotechar` inside a field.
escapechar : str, default None
    String of length 1. Character used to escape `sep` and `quotechar`
    when appropriate.
decimal : str, default '.'
    Character recognized as decimal separator. E.g. use ',' for
    European data.
errors : str, default 'strict'
    Specifies how encoding and decoding errors are to be handled.
    See the errors argument for :func:`open` for a full list
    of options.

    .. versionadded:: 1.1.0

storage_options : dict, optional
    Extra options that make sense for a particular storage connection, e.g.
    host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
    are forwarded to ``urllib`` as header options. For other URLs (e.g.
    starting with "s3://", and "gcs://") the key-value pairs are forwarded to
    ``fsspec``. Please see ``fsspec`` and ``urllib`` for more details.

    .. versionadded:: 1.2.0

Returns
-------
None or str
    If path_or_buf is None, returns the resulting csv format as a
    string. Otherwise returns None.

See Also
--------
read_csv : Load a CSV file into a DataFrame.
to_excel : Write DataFrame to an Excel file.

Examples
--------
>>> df = pd.DataFrame({'name': ['Raphael', 'Donatello'],
...                    'mask': ['red', 'purple'],
...                    'weapon': ['sai', 'bo staff']})
>>> df.to_csv(index=False)
'name,mask,weapon\nRaphael,red,sai\nDonatello,purple,bo staff\n'

Create 'out.zip' containing 'out.csv'

>>> compression_opts = dict(method='zip',
...                         archive_name='out.csv')  # doctest: +SKIP
>>> df.to_csv('out.zip', index=False,
...           compression=compression_opts)  # doctest: +SKIP

To write a csv file to a new folder or nested folder you will first
need to create it using either Pathlib or os:

>>> from pathlib import Path  # doctest: +SKIP
>>> filepath = Path('folder/subfolder/out.csv')  # doctest: +SKIP
>>> filepath.parent.mkdir(parents=True, exist_ok=True)  # doctest: +SKIP
>>> df.to_csv(filepath)  # doctest: +SKIP

>>> import os  # doctest: +SKIP
>>> os.makedirs('folder/subfolder', exist_ok=True)  # doctest: +SKIP
>>> df.to_csv('folder/subfolder/out.csv')  # doctest: +SKIP
File:      c:\users\caíque miranda\appdata\local\programs\python\python310\lib\site-packages\pandas\core\generic.py
Type:      method

In [10]:
# Criando um conjunto de dados para o exercício

names = ['Bob', 'Jessica', 'Mary', 'John', 'Mel'] 

notas = [76, 95, 77, 78, 99] 
bsdegrees = [1, 1, 0, 0, 1] 
msdegrees = [2, 1, 0, 0, 0] 
phddegrees = [0, 1, 0, 0, 0]

Graus = zip(nomes, notas, bsdegrees, msdegrees, phddegrees) 

colunas = ['Nomes', 'Notas', 'BS', 'MS', 'PhD'] 

df = pd.DataFrame(data = Graus,
                  columns = colunas ) 

df

     Nomes  Notas  BS  MS  PhD
0      Bob     76   1   2    0
1  Jessica     95   1   1    1
2     Mary     77   0   0    0
3     John     78   0   0    0
4      Mel     99   1   0    0

Você pode exportar o dataframe criado pelo código na Listagem

#### Carregando dados de arquivos do Excel

Normalmente, os dados chegarão até nós como arquivos ou links de banco de dados. Vamos ver como carregar dados de um arquivo Excel

In [11]:
# Carregando dados do arquivo do Excel

caminho = "datasets/gradedata.xlsx"
df = pd.read_excel(caminho)

vamos dar uma olhada

In [12]:
# Exibir as cinco primeiras linhas de dados
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

Se desejar alterar ou simplificar os nomes das colunas, você pode executar o código
mostrado na Listagem 2-11.

In [13]:
# Alterar nomes de colunas

df.columns = ['first', 'last', 'sex', 'age', 'exer', 'hrs', 'grd', 'addr'] 
df.head()

,first,last,sex,age,exer,hrs,grd,addr
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

#### Salvando dados em arquivos do Excel

In [14]:
# Exportando um Dataframe para o Excel

nomes = ['Bob', 'Jessica', 'Mary', 'John', 'Mel'] 
notas = [76, 95, 77, 78, 99]

GradeList = zip(nomes, notas) 
df = pd.DataFrame(data = GradeList, 
                  columns = ['Nomes', 'Notas']) 

escritor = pd.ExcelWriter('datasets/dataframe.xlsx', 
                          engine = 'xlsxwriter') 

df.to_excel(escritor, sheet_name = 'Planilha1') 

escritor.save()

Se desejar, você pode salvar diferentes quadros de dados em diferentes planilhas e com um `.save()` você criará um arquivo do Excel com várias planilhas

In [15]:
nomes = ['Bob', 'Jessica', 'Mary', 'John', 'Mel'] 
notas = [33, 93, 47, 99, 49]

GradeList = zip(nomes, notas) 
df2 = pd.DataFrame(data = GradeList, 
                  columns = ['Nomes', 'Notas'])

In [16]:
# Exportando Múltiplos Dataframes para o Excel

escritor = pd.ExcelWriter('datasets/dataframe.xlsx',
                          engine = 'xlsxwriter') 
df.to_excel(escritor, 
            sheet_name = 'Sheet1') 

df2.to_excel(escritor, 
             sheet_name = 'Sheet2') 

escritor.save()

In [17]:
# Criando um conjunto de dados para o exercício

marca = ['Nike', 'Adidas', 'New Balance', 'Puma', 'Reebok'] 
price = [176, 59, 47, 38, 99]

PriceList = zip(marca, price) 
df = pd.DataFrame(data = PriceList, 
                  columns = ['Marca', 'Preços'])

Combinando dados de vários arquivos do Excel

Às vezes, precisaremos combinar os dados de vários. Arquivos do Excel no mesmo dataframe.

Podemos fazer isso pelo caminho mais longo ou pelo caminho mais curto.

In [18]:
# Caminho Longo

import numpy as np

dados_completos = pd.DataFrame()

df = pd.read_excel("datasets/data1.xlsx") 
dados_completos = dados_completos.append(df, ignore_index=True)

df = pd.read_excel("datasets/data2.xlsx") 
dados_completos = dados_completos.append(df, ignore_index=True)

df = pd.read_excel("datasets/data3.xlsx") 
dados_completos = dados_completos.append(df, ignore_index=True) 

dados_completos.describe()

              age       grade
count  300.000000  300.000000
mean    16.456667   82.923333
std      1.700321   10.544576
min     14.000000   65.000000
25%     15.000000   73.750000
50%     16.000000   82.000000
75%     18.000000   92.000000
max     19.000000  100.000000

- Linha 5: Primeiro, vamos definir dados_completos para um dataframe vazio.
- Linha 7: Carregue o primeiro arquivo Excel no dataframe df.
- Linha 8: Anexa o conteúdo de df ao dataframe dados_completos.
- Linhas 10 e 11: Basicamente o mesmo que as linhas 7 e 8, mas para o próximo arquivo do Excel.

In [19]:
# Caminho curto

import glob

dados_completos = pd.DataFrame() 

for f in glob.glob("datasets/data*.xlsx"):
    df = pd.read_excel(f) 
    dados_completos = dados_completos.append(df, ignore_index = True)

dados_completos.describe()

              age       grade  Unnamed: 0      Notas
count  300.000000  300.000000    5.000000   5.000000
mean    16.456667   82.923333    2.000000  85.000000
std      1.700321   10.544576    1.581139  11.067972
min     14.000000   65.000000    0.000000  76.000000
25%     15.000000   73.750000    1.000000  77.000000
50%     16.000000   82.000000    2.000000  78.000000
75%     18.000000   92.000000    3.000000  95.000000
max     19.000000  100.000000    4.000000  99.000000

- Linha 3: Importa a biblioteca glob
- Linha 5: Vamos definir dados_completos para um dataframe vazio.
- Linha 6: Esta linha percorrerá todos os arquivos que correspondem ao padrão.
- Linha 7: Carregue o arquivo Excel em f no dataframe df.
- Linha 8: Anexa o conteúdo de df ao dataframe dados_completos.

Como temos apenas três arquivos de dados, a diferença no código não é tão perceptível. No entanto, se estivéssemos carregando cem arquivos, a diferença na quantidade de código seria enorme. Este código carregará todos os arquivos do Excel cujos nomes começam com dados que estão no diretório de conjuntos de dados, não importa quantos existam.

Na pasta datasets/weekly_call_data, existem 104 arquivos de dados de chamadas semanais por dois anos. Vamos carregar todos esses dados em um dataframe.

In [20]:
# Caminho curto

import glob

dados_completos = pd.DataFrame() 

for f in glob.glob("datasets/weekly_call_data/weekdata_*.xlsx"):
    df = pd.read_excel(f) 
    dados_completos = dados_completos.append(df, ignore_index = True)

dados_completos.describe()

          Unnamed: 0   CallDuration
count  129588.000000  129588.000000
mean      688.521476      12.517147
std       457.631443       6.925404
min         0.000000       1.000000
25%       311.000000       7.000000
50%       623.000000      13.000000
75%      1009.000000      19.000000
max      1944.000000      24.000000

In [21]:
dados_completos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 129588 entries, 0 to 129587
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Unnamed: 0      129588 non-null  int64
 1   CallingNumber   129588 non-null  object
 2   DayOfWeek       129588 non-null  object
 3   TimeOfDay       129588 non-null  object
 4   CallDuration    129588 non-null  int64
 5   ReasonForCall   129588 non-null  object
 6   AnsweringAgent  129588 non-null  object
dtypes: int64(2), object(5)
memory usage: 6.9+ MB

#### Carregando dados do SQL

Normalmente, nossos dados chegarão até nós como arquivos ou links de banco de dados. Vamos aprender como carregar nossos dados de um arquivo de banco de dados sqlite.

In [22]:
# Carregar dados do sqlite

from sqlalchemy import create_engine # Conecte-se ao sqlite db 

db_caminho = r'datasets/gradedata.db'

engine = create_engine(r"sqlite:///{}" .format(db_caminho))

sql =' SELECT * FROM test'
'WHERE Grades in (76, 77, 78)'

dados_de_vendas_df = pd.read_sql(sql, engine) 
dados_de_vendas_df

   index    Names  Grades
0      0      Bob      76
1      1  Jessica      95
2      2     Mary      77
3      3     John      78
4      4      Mel      99

Esse código cria um link para o arquivo de banco de dados chamado `gradedata.db` e executa uma consulta nele. Em seguida, ele carrega os dados resultantes dessa consulta no dataframe chamado dados_de_vendas_df. Se você não souber os nomes das tabelas em um banco de dados sqlite, poderá descobrir alterando a instrução SQL.

In [23]:
# Encontrando os nomes das tabelas

sql = "SELECT name FROM sqlite_master"
"WHERE type = 'table';"

"WHERE type = 'table';"

In [24]:
dados_de_vendas_df = pd.read_sql(sql, engine)
dados_de_vendas_df

            name
0           test
1  ix_test_index

Depois de saber o nome de uma tabela que deseja visualizar (digamos que seja um teste), se quiser saber os nomes dos campos dessa tabela, você pode alterar sua instrução SQL

In [25]:
# Uma consulta básica

sql = "SELECT * FROM test;"

In [26]:
dados_de_vendas_df = pd.read_sql(sql, engine)
dados_de_vendas_df

   index    Names  Grades
0      0      Bob      76
1      1  Jessica      95
2      2     Mary      77
3      3     John      78
4      4      Mel      99

In [27]:
dados_de_vendas_df.head()

   index    Names  Grades
0      0      Bob      76
1      1  Jessica      95
2      2     Mary      77
3      3     John      78
4      4      Mel      99

Então, depois de executar `dados_de_vendas_df.head()` no dataframe, você ser capaz de ver os campos como cabeçalhos no topo de cada coluna.

Como sempre, se precisar de mais informações sobre o comando,

In [28]:
# Obtenha ajuda em read_sql

pd.read_sql?

Signature:
pd.read_sql(
    sql,
    con,
    index_col: 'str | Sequence[str] | None' = None,
    coerce_float: 'bool' = True,
    params=None,
    parse_dates=None,
    columns=None,
    chunksize: 'int | None' = None,
) -> 'DataFrame | Iterator[DataFrame]'
Docstring:
Read SQL query or database table into a DataFrame.

This function is a convenience wrapper around ``read_sql_table`` and
``read_sql_query`` (for backward compatibility). It will delegate
to the specific function depending on the provided input. A SQL query
will be routed to ``read_sql_query``, while a database table name will
be routed to ``read_sql_table``. Note that the delegated function might
have more specific notes about their functionality not listed here.

Parameters
----------
sql : str or SQLAlchemy Selectable (select or text object)
    SQL query to be executed or a table name.
con : SQLAlchemy connectable, str, or sqlite3 connection
    Using SQLAlchemy makes it possible to use any DB supported by that
    library. If a DBAPI2 object, only sqlite3 is supported. The user is responsible
    for engine disposal and connection closure for the SQLAlchemy connectable; str
    connections are closed automatically. See
    `here <https://docs.sqlalchemy.org/en/13/core/connections.html>`_.
index_col : str or list of str, optional, default: None
    Column(s) to set as index(MultiIndex).
coerce_float : bool, default True
    Attempts to convert values of non-string, non-numeric objects (like
    decimal.Decimal) to floating point, useful for SQL result sets.
params : list, tuple or dict, optional, default: None
    List of parameters to pass to execute method.  The syntax used
    to pass parameters is database driver dependent. Check your
    database driver documentation for which of the five syntax styles,
    described in PEP 249's paramstyle, is supported.
    Eg. for psycopg2, uses %(name)s so use params={'name' : 'value'}.
parse_dates : list or dict, default: None
    - List of column names to parse as dates.
    - Dict of ``{column_name: format string}`` where format string is
      strftime compatible in case of parsing string times, or is one of
      (D, s, ns, ms, us) in case of parsing integer timestamps.
    - Dict of ``{column_name: arg dict}``, where the arg dict corresponds
      to the keyword arguments of :func:`pandas.to_datetime`
      Especially useful with databases without native Datetime support,
      such as SQLite.
columns : list, default: None
    List of column names to select from SQL table (only used when reading
    a table).
chunksize : int, default None
    If specified, return an iterator where `chunksize` is the
    number of rows to include in each chunk.

Returns
-------
DataFrame or Iterator[DataFrame]

See Also
--------
read_sql_table : Read SQL database table into a DataFrame.
read_sql_query : Read SQL query into a DataFrame.

Examples
--------
Read data from SQL via either a SQL query or a SQL tablename.
When using a SQLite database only SQL queries are accepted,
providing only the SQL tablename will result in an error.

>>> from sqlite3 import connect
>>> conn = connect(':memory:')
>>> df = pd.DataFrame(data=[[0, '10/11/12'], [1, '12/11/10']],
...                   columns=['int_column', 'date_column'])
>>> df.to_sql('test_data', conn)
2

>>> pd.read_sql('SELECT int_column, date_column FROM test_data', conn)
   int_column date_column
0           0    10/11/12
1           1    12/11/10

>>> pd.read_sql('test_data', 'postgres:///db_name')  # doctest:+SKIP

Apply date parsing to columns through the ``parse_dates`` argument

>>> pd.read_sql('SELECT int_column, date_column FROM test_data',
...             conn,
...             parse_dates=["date_column"])
   int_column date_column
0           0  2012-10-11
1           1  2010-12-11

The ``parse_dates`` argument calls ``pd.to_datetime`` on the provided columns.
Custom argument values for applying ``pd.to_datetime`` on a column are specified
via a dictionary format:
1. Ignore errors while parsing the values of "date_column"

>>> pd.read_sql('SELECT int_column, date_column FROM test_data',
...             conn,
...             parse_dates={"date_column": {"errors": "ignore"}})
   int_column date_column
0           0  2012-10-11
1           1  2010-12-11

2. Apply a dayfirst date parsing order on the values of "date_column"

>>> pd.read_sql('SELECT int_column, date_column FROM test_data',
...             conn,
...             parse_dates={"date_column": {"dayfirst": True}})
   int_column date_column
0           0  2012-11-10
1           1  2010-11-12

3. Apply custom formatting when date parsing the values of "date_column"

>>> pd.read_sql('SELECT int_column, date_column FROM test_data',
...             conn,
...             parse_dates={"date_column": {"format": "%d/%m/%y"}})
   int_column date_column
0           0  2012-11-10
1           1  2010-11-12
File:      c:\users\caíque miranda\appdata\local\programs\python\python310\lib\site-packages\pandas\io\sql.py
Type:      function

vamos carregar dados do banco de dados `datasets/salesdata.db`

In [29]:
db_caminho = r'datasets/salesdata.db'

engine = create_engine(r"sqlite:///{}" .format(db_caminho))

# Encontrando os nomes das tabelas
sql = "SELECT name FROM sqlite_master"
"WHERE type = 'table';"

dados_de_vendas_df = pd.read_sql(sql, engine) 
dados_de_vendas_df

              name
0           scores
1  ix_scores_index

In [30]:
# Encontrando os nomes das tabelas

sql = "SELECT * FROM scores"

In [31]:
dados_de_vendas_df = pd.read_sql(sql, engine)
dados_de_vendas_df

    index  Sales Person  Intelligence  Extroversion  $ Sales/Week
0       0             1            89            21          2625
1       1             2            93            24          2700
2       2             3            91            21          3100
3       3             4           122            23          3150
4       4             5           115            27          3175
5       5             6           180            18          3100
6       6             7            98            19          2700
7       7             8           105            16          2475
8       8             9           112            23          3625
9       9            10           109            28          3525
10     10            11           130            20          3225
11     11            12           104            25          3450
12     12            13           104            20          2425
13     13            14           111            26          3025
14     14            15            97            28          3625
15     15            16           115            29          2750
16     16            17           113            25          3150
17     17            18            88            23          2600
18     18            19           108            19          2525
19     19            20           101            16          2650

#### Salvando dados em SQL

In [32]:
# Criar conjunto de dados para salvar

nomes = ['Bob', 'Jessica', 'Mary', 'John', 'Mel'] 
notas =[76, 95, 77, 78, 99]

GradeList = zip(nomes,notas) 
df = pd.DataFrame(data = GradeList,
                  columns = ['Nomes', 'Notas'])

df

     Nomes  Notas
0      Bob     76
1  Jessica     95
2     Mary     77
3     John     78
4      Mel     99

Para exportá-lo para SQL, podemos usar esse código.

In [33]:
# Exportar dataframe para sqlite
import os
import sqlite3 as lite

db_nome_arquivo = r'datasets/mydb.db' 

con = lite.connect(db_nome_arquivo)
df.to_sql('minha_tabela',
          con,
          schema = None,
          if_exists = 'replace',
          index = True,
          index_label = None,
          chunksize = None,
          dtype = None)

con.close()

- Linha 5: `mydb.db` é o caminho e o nome do sqlite banco de dados que você deseja usar.
- Linha 8: `minha_tabela` é o nome da tabela no base de dados.

se precisar de mais informações sobre o comando, você pode execute o código

In [34]:
# Obtenha ajuda sobre to_sql

df.to_sql?

Signature:
df.to_sql(
    name: 'str',
    con,
    schema=None,
    if_exists: 'str' = 'fail',
    index: 'bool_t' = True,
    index_label=None,
    chunksize=None,
    dtype: 'DtypeArg | None' = None,
    method=None,
) -> 'int | None'
Docstring:
Write records stored in a DataFrame to a SQL database.

Databases supported by SQLAlchemy [1]_ are supported. Tables can be
newly created, appended to, or overwritten.

Parameters
----------
name : str
    Name of SQL table.
con : sqlalchemy.engine.(Engine or Connection) or sqlite3.Connection
    Using SQLAlchemy makes it possible to use any DB supported by that
    library. Legacy support is provided for sqlite3.Connection objects. The user
    is responsible for engine disposal and connection closure for the SQLAlchemy
    connectable See `here                 <https://docs.sqlalchemy.org/en/13/core/connections.html>`_.

schema : str, optional
    Specify the schema (if database flavor supports this). If None, use
    default schema.
if_exists : {'fail', 'replace', 'append'}, default 'fail'
    How to behave if the table already exists.

    * fail: Raise a ValueError.
    * replace: Drop the table before inserting new values.
    * append: Insert new values to the existing table.

index : bool, default True
    Write DataFrame index as a column. Uses `index_label` as the column
    name in the table.
index_label : str or sequence, default None
    Column label for index column(s). If None is given (default) and
    `index` is True, then the index names are used.
    A sequence should be given if the DataFrame uses MultiIndex.
chunksize : int, optional
    Specify the number of rows in each batch to be written at a time.
    By default, all rows will be written at once.
dtype : dict or scalar, optional
    Specifying the datatype for columns. If a dictionary is used, the
    keys should be the column names and the values should be the
    SQLAlchemy types or strings for the sqlite3 legacy mode. If a
    scalar is provided, it will be applied to all columns.
method : {None, 'multi', callable}, optional
    Controls the SQL insertion clause used:

    * None : Uses standard SQL ``INSERT`` clause (one per row).
    * 'multi': Pass multiple values in a single ``INSERT`` clause.
    * callable with signature ``(pd_table, conn, keys, data_iter)``.

    Details and a sample callable implementation can be found in the
    section :ref:`insert method <io.sql.method>`.

Returns
-------
None or int
    Number of rows affected by to_sql. None is returned if the callable
    passed into ``method`` does not return the number of rows.

    The number of returned rows affected is the sum of the ``rowcount``
    attribute of ``sqlite3.Cursor`` or SQLAlchemy connectable which may not
    reflect the exact number of written rows as stipulated in the
    `sqlite3 <https://docs.python.org/3/library/sqlite3.html#sqlite3.Cursor.rowcount>`__ or
    `SQLAlchemy <https://docs.sqlalchemy.org/en/14/core/connections.html#sqlalchemy.engine.BaseCursorResult.rowcount>`__.

    .. versionadded:: 1.4.0

Raises
------
ValueError
    When the table already exists and `if_exists` is 'fail' (the
    default).

See Also
--------
read_sql : Read a DataFrame from a table.

Notes
-----
Timezone aware datetime columns will be written as
``Timestamp with timezone`` type with SQLAlchemy if supported by the
database. Otherwise, the datetimes will be stored as timezone unaware
timestamps local to the original timezone.

References
----------
.. [1] https://docs.sqlalchemy.org
.. [2] https://www.python.org/dev/peps/pep-0249/

Examples
--------
Create an in-memory SQLite database.

>>> from sqlalchemy import create_engine
>>> engine = create_engine('sqlite://', echo=False)

Create a table from scratch with 3 rows.

>>> df = pd.DataFrame({'name' : ['User 1', 'User 2', 'User 3']})
>>> df
     name
0  User 1
1  User 2
2  User 3

>>> df.to_sql('users', con=engine)
3
>>> engine.execute("SELECT * FROM users").fetchall()
[(0, 'User 1'), (1, 'User 2'), (2, 'User 3')]

An `sqlalchemy.engine.Connection` can also be passed to `con`:

>>> with engine.begin() as connection:
...     df1 = pd.DataFrame({'name' : ['User 4', 'User 5']})
...     df1.to_sql('users', con=connection, if_exists='append')
2

This is allowed to support operations that require that the same
DBAPI connection is used for the entire operation.

>>> df2 = pd.DataFrame({'name' : ['User 6', 'User 7']})
>>> df2.to_sql('users', con=engine, if_exists='append')
2
>>> engine.execute("SELECT * FROM users").fetchall()
[(0, 'User 1'), (1, 'User 2'), (2, 'User 3'),
 (0, 'User 4'), (1, 'User 5'), (0, 'User 6'),
 (1, 'User 7')]

Overwrite the table with just ``df2``.

>>> df2.to_sql('users', con=engine, if_exists='replace',
...            index_label='id')
2
>>> engine.execute("SELECT * FROM users").fetchall()
[(0, 'User 6'), (1, 'User 7')]

Specify the dtype (especially useful for integers with missing values).
Notice that while pandas is forced to store the data as floating point,
the database supports nullable integers. When fetching the data with
Python, we get back integer scalars.

>>> df = pd.DataFrame({"A": [1, None, 2]})
>>> df
     A
0  1.0
1  NaN
2  2.0

>>> from sqlalchemy.types import Integer
>>> df.to_sql('integers', con=engine, index=False,
...           dtype={"A": Integer()})
3

>>> engine.execute("SELECT * FROM integers").fetchall()
[(1,), (None,), (2,)]
File:      c:\users\caíque miranda\appdata\local\programs\python\python310\lib\site-packages\pandas\core\generic.py
Type:      method

vamos criar uma tabela sqlite que contenha os dados encontrados em `datasets/gradedata.csv`

#### Números aleatórios e criação dados aleatórios

Normalmente você usará as técnicas com conjuntos de dados reais. No entanto, às vezes você precisará criar valores aleatórios.

Digamos que queríamos fazer uma lista aleatória de nomes de bebês. nós poderíamos conseguir dessa forma

In [35]:
# Começando

import random 
from numpy.random import randint 

nomes = ['Bob', 'Jessica', 'Mary', 'John', 'Mel']

importamos nossas bibliotecas como de costume. Na última linha, criamos uma lista dos nomes que selecionaremos aleatoriamente

Em seguida, adicionamos o código

In [36]:
# Semeando Gerador Aleatório

random.seed(500)

Isso semeia o gerador de números aleatórios. Se você usar a mesma semente, obterá os mesmos números "aleatórios".

In [37]:
# 1. randint(low = 0, high = len(nomes))

Gera um inteiro aleatório entre zero e o comprimento dos nomes da lista.

In [38]:
# 2. nomes[n]

Seleciona o nome onde seu índice é igual a n.

In [39]:
# 3. for i in range(n)

Faz um loop até que i seja igual a n, ou seja, 1,2,3,….n.

In [40]:
# 4. random_names =

Seleciona um nome aleatório da lista de nomes e não isso n vezes.

Faremos tudo isso agora.

In [41]:
# Seleção de 1.000 nomes aleatórios

nomes_aleatorios = [] 

for i in range(1_000): 
    nome = nomes[randint(low = 0, 
                         high = len(nomes))] 
    
    nomes_aleatorios.append(nome)

Agora temos uma lista de 1000 nomes aleatórios salvos em nosso `nomes_aleatorios` variável. Vamos criar uma lista de 1000 números aleatórios de 0 a 1000

In [42]:
# Seleção de 1.000 números aleatórios

nascimentos = [] 
for i in range(1000):
    nascimentos.append(randint(low = 0, 
                               high = 1_000))

E, finalmente, junte as duas listas e crie o dataframe

In [43]:
# Criando conjunto de dados a partir de listas de nomes e números aleatórios

BabyDataSet2 = list(zip(nomes_aleatorios, nascimentos)) 
df = pd.DataFrame(data = BabyDataSet2, 
                  columns = ['Nomes', 'Nascimentos'])

df

       Nomes  Nascimentos
0        Mel          827
1    Jessica          230
2        Mel          214
3        Bob          359
4       John          492
..       ...          ...
995      Bob          789
996     Mary          918
997  Jessica          783
998      Mel          217
999     Mary          602

[1000 rows x 2 columns]

Crie um dataframe chamado parkingtickets com 250 linhas contendo um nome e um número entre 1 e 25.

In [44]:
# Seleção de 30 nomes aleatórios
nomes_aleatorios = [] 

for i in range(30): 
    nome = nomes[randint(low = 0, 
                         high = len(nomes))] 
    
    nomes_aleatorios.append(nome)

# Seleção de 30 números aleatórios
numeros_aleatorios = [] 

for i in range(30):
    numeros_aleatorios.append(randint(low = 0, 
                                      high = 30))

parkingtickets = list(zip(nomes_aleatorios, nascimentos)) 
df = pd.DataFrame(data = parkingtickets, 
                  columns = ['Nomes', 'Numeros'])

df

      Nomes  Numeros
0      Mary      827
1      Mary      230
2       Bob      214
3      Mary      359
4      John      492
5       Bob      359
6   Jessica      602
7       Bob      707
8       Mel      993
9      John      244
10      Mel      244
11      Mel      547
12     John      679
13  Jessica      860
14     Mary      730
15      Bob      711
16      Mel      841
17  Jessica      800
18      Mel      884
19     John      674
20      Bob      230
21  Jessica        3
22     John       23
23      Bob      588
24  Jessica      651
25      Mel      160
26  Jessica      357
27      Bob      734
28     Mary      749
29      Mel      357

In [45]:
%reload_ext watermark
%watermark -a "Caique Miranda" -gu "caiquemiranda" -iv

Author: Caique Miranda

Github username: caiquemiranda

pandas : 1.4.3
sqlite3: 2.6.0
numpy  : 1.23.0

### End.